Revit 2020 API
DisplayStyle Enumeration
 Display type of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2013
Syntax
C#
public enum DisplayStyle
Visual Basic
Public Enumeration DisplayStyle
Visual C++
public enum class DisplayStyle
Members
Member name | Description
Undefined |  View does not use Render Type
Wireframe |  Wireframe
HLR |  Hidden Line Removal
Shading |  Shading
ShadingWithEdges |  Shading With Edges
Rendering |  Rendering
Realistic |  Realistic
FlatColors |  Flat Colors
RealisticWithEdges |  Realistic With Edges
Raytrace |  Raytrace. Because setting a view's display style to raytrace enters a special restricted mode with limited capabilities, it is not permitted to directly assign the display style to this value.
See Also
Autodesk.Revit.DB Namespace